<!-- dflook/terraform-github-actions {"workspace":"default","backend":"e643e43f70f1d1ac981c294e2da20adb33159e0a1242506447decb42962177dc","backend_type":"artifactory"} -->
Terraform plan in __terraform/demo-app__
<details>
<summary>Plan: 2 to add, 2 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.demo_app_1.kubernetes_deployment.app_deployment will be updated in-place
  ~ resource "kubernetes_deployment" "app_deployment" {
        id               = "b0f542-dev/ssag-demo-app-1"
        # (1 unchanged attribute hidden)


      ~ spec {
            # (5 unchanged attributes hidden)



          ~ template {

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "roysagar11/ssag:v0.0.4" -> "roysagar11/ssag"
                        name                       = "ssag-demo-app-1"
                        # (8 unchanged attributes hidden)


                        # (2 unchanged blocks hidden)
                    }

                    # (1 unchanged block hidden)
                }
                # (1 unchanged block hidden)
            }
            # (2 unchanged blocks hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.demo_app_1.kubernetes_ingress.app_ingress will be created
  + resource "kubernetes_ingress" "app_ingress" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "route.openshift.io/termination" = "edge"
            }
          + generation       = (known after apply)
          + name             = "ssag-demo-app-1"
          + namespace        = "b0f542-dev"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + backend {
              + service_name = "ssag-demo-app-1"
              + service_port = "80"
            }

          + rule {
              + host = "demo-app-1.apps.silver.devops.gov.bc.ca"

              + http {
                  + path {
                      + path = "/"

                      + backend {
                          + service_name = "ssag-demo-app-1"
                          + service_port = "80"
                        }
                    }
                }
            }
        }
    }

  # module.demo_app_2.kubernetes_deployment.app_deployment will be updated in-place
  ~ resource "kubernetes_deployment" "app_deployment" {
        id               = "b0f542-dev/ssag-demo-app-2"
        # (1 unchanged attribute hidden)


      ~ spec {
            # (5 unchanged attributes hidden)



          ~ template {

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "roysagar11/ssag:v0.0.4" -> "roysagar11/ssag"
                        name                       = "ssag-demo-app-2"
                        # (8 unchanged attributes hidden)


                        # (2 unchanged blocks hidden)
                    }

                    # (1 unchanged block hidden)
                }
                # (1 unchanged block hidden)
            }
            # (2 unchanged blocks hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.demo_app_2.kubernetes_ingress.app_ingress will be created
  + resource "kubernetes_ingress" "app_ingress" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "route.openshift.io/termination" = "edge"
            }
          + generation       = (known after apply)
          + name             = "ssag-demo-app-2"
          + namespace        = "b0f542-dev"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + backend {
              + service_name = "ssag-demo-app-2"
              + service_port = "80"
            }

          + rule {
              + host = "demo-app-2.apps.silver.devops.gov.bc.ca"

              + http {
                  + path {
                      + path = "/"

                      + backend {
                          + service_name = "ssag-demo-app-2"
                          + service_port = "80"
                        }
                    }
                }
            }
        }
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Runs Demo applications terraform plan #34](https://github.com/bcgov/social-access-portal/actions/runs/2465062772)